using System;
using System.Collections.Generic;
using System.Linq;
using System.Reflection;
using System.Text;
using System.Threading.Tasks;

namespace CopyCopy
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.InputEncoding = Encoding.Unicode;
            Console.OutputEncoding = Encoding.Unicode;

            bool isOpen = true;
            WorldCup[] dataWorldCups = CreateDataWorldCups();

            while (isOpen)
            {
                Console.WriteLine("Ласкаво просимо до програми-довідника чемпіонатів світу з футболу!\n");

                Console.WriteLine($"Чемпіонат світу з футболу (Кубок світу з футболу) — міжнародне футбольне змагання, " +
                    $"в якому беруть участь чоловічі збірні команди країн — членів ФІФА. Змагання проводяться раз на чотири роки," +
                    $" починаючи з першого турніру в 1930 році.\n");

                Console.WriteLine("Для продовження роботи оберіть одну з доступних опцій:\n");

                Console.WriteLine("1 - Переглянути список всіх чемпіонатів світу з футболу.\n");
                Console.WriteLine("2 - Знайти інформацію про чемпіонат світу за певний рік.\n");
                Console.WriteLine("3 - Дізнатись на яких турнірах приймала участь ваша улюблена збірна.\n");
                Console.WriteLine("4 - Переглянути список переможців за всі роки чемпіонату світу.\n");
                Console.WriteLine("5 - Дізнатися команду, яка найбільше грала у фіналах, але так і не вигравала кубок.\n");
                Console.WriteLine("0 - Вихід\n");

                Console.Write("Ваш вибір: ");
                string choosedOption = Console.ReadLine();

                switch (choosedOption)
                {
                    case "1":
                        ShowYearAndLocationWorldCups(dataWorldCups);
                        break;
                    case "2":
                        Console.Write("Введіть рік проведення чемпіонату світу: ");
                        string inputYear = Console.ReadLine();

                        int index = FindWorldCupIndexByYear(dataWorldCups, inputYear);

                        if (index != -1)
                        {
                            ShowDetailInfoByIndex(dataWorldCups, index);
                        }
                        else
                        {
                            HandleInvalidYear(inputYear);
                        }
                        break;
                    case "3":
                        Console.Write("Введіть назву вашої улюбленої збірної: ");
                        string inputCountry = Console.ReadLine();

                        WorldCup[] worldCupsByFavoriteCountry = FindWorldCupsByCountry(dataWorldCups, inputCountry);

                        if (worldCupsByFavoriteCountry.Length > 0)
                        {
                            ShowFavoriteTeamInfo(worldCupsByFavoriteCountry, inputCountry);
                        }
                        else
                        {
                            HandleInvalidCountry(inputCountry);
                        }
                        break;
                    case "4":
                        string[,] winners = GetWorldCupsWinnersWithCounts(dataWorldCups);
                        string[,] sortedWinners = SortByCountWins(winners);
                        ShowWinnersWorldCups(sortedWinners);
                        break;
                    case "5":
                        string[,] losers = GetWorldCupsLosersWithCounts(dataWorldCups);
                        string[] mainLoser = FindMainLoserWorldCups(losers);
                        ShowMainLoserWorldCups(mainLoser);
                        break;
                    case "0":
                        isOpen = false;
                        break;
                    default:
                        WriteError("Така опція відсутня");
                        break;
                }

                if (isOpen)
                {
                    Console.Write("\nНатисніть будь-яку клавішу для продовження ");
                }
                else
                {
                    Console.Write("\nНатисніть будь-яку клавішу для завершення ");
                }
                Console.ReadKey();
                Console.Clear();
            }
        }
        static void WriteError(string message)
        {
            ConsoleColor defaultColor = Console.ForegroundColor;
            Console.ForegroundColor = ConsoleColor.Red;
            Console.WriteLine(message);
            Console.ForegroundColor = defaultColor;
        }

        static WorldCup[] CreateDataWorldCups()
        {
            return new WorldCup[] {
                new WorldCup("1930", "Уругвай", "Аргентина", "Уругвай", new string[] { "Аргентина", "Чилі", "Франція", "Мексика", "Югославія", "Бразилія", "Болівія", "Уругвай", "Румунія", "Перу", "США", "Парагвай", "Бельгія"},"Чемпіонат світу з футболу 1930 — перший за ліком чемпіонат світу, відбувся в Уругваї з 13 по 30 липня 1930 року. Уругвай ФІФА обрала у зв'язку зі святкуванням сторіччя незалежності країни, а також через перемоги футбольної збірної країни на двох останніх на той час літніх Олімпійських іграх 1924 та 1928 років. У чемпіонаті брали участь лише тринадцять збірних: сім з Південної Америки, дві з Північної Америки та чотири з Європи."),
                new WorldCup("1934", "Італія", "Чехословаччина", "Італія", new string[] { "Австрія", "Аргентина", "Бельгія", "Бразилія", "Єгипет", "Іспанія", "Італія", "Нідерланди", "Німеччина", "Румунія", "США", "Угорщина", "Франція", "Чехословаччина", "Швейцарія", "Швеція"}, "Чемпіонат світу з футболу 1934 року — другий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 27 травня по 10 червня 1934 року в Італії. Перший чемпіонат світу, фінальній частині якого передував кваліфікаційний раунд, адже готовність і бажання взяти участь у ньому висловили представники 32 країн, а формат змагання передбачав участь лише 16 збірних. Діючі чемпіони світу, збірна Уругваю, відкинули можливість захисту титулу на полях Європи, загалом відмовившись від участі у чемпіонаті світу 1934 року на знак протесту проти фактичного ігнорування першого чемпіонату світу, що пройшов в Уругваї, майже всіма європейськими командами."),
                new WorldCup("1938", "Франція", "Угорщина", "Італія", new string[] { "Бельгія", "Бразилія", "Куба", "Чехословаччина", "Нідерландська Ост-Індія", "Франція", "Німеччина", "Угорщина", "Італія", "Нідерланди", "Норвегія", "Польща", "Румунія", "Швеція", "Швейцарія"}, "Чемпіонат світу з футболу 1938 року — третій чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 4 по 19 червня 1938 року у Франції. Країною-господарем чемпіонату світу 1938 року на зустрічі ФІФА у Берліні 13 серпня 1936 була обрана Франція, яка обійшла Аргентину і Німеччину вже у першому ж раунді голосування. Рішення провести другу поспіль світову першість в Європі (після турніру в Італії 1934 року) спричинило невдоволення у Південній Америці, більшість представників якої знялися зі змагання перед початком кваліфікаційного раунду."),
                new WorldCup("1950", "Бразилія", "Бразилія", "Уругвай", new string[] { "Бразилія", "Мексика", "Югославія", "Швейцарія", "Англія", "Іспанія", "Чилі", "США", "Швеція", "Італія", "Парагвай", "Уругвай", "Болівія"}, "Чемпіонат світу з футболу 1950 року — четвертий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 24 червня по 16 липня 1950 року на полях Бразилії. Перша світова футбольна першість за 12 років, оскільки турніри 1942 і 1946 років були скасовані через Другу світову війну. Єдина футбольна першість світу, формат якої не передбачав проведення фінального матчу. Переможцем турніру стала збірна Уругваю, яка у вирішальній грі фінального раунду, яка стала одним з найдраматичніших епізодів в історії спорту"),
                new WorldCup("1954", "Швейцарія", "Угорщина", "ФРН", new string[] { "Австрія", "Бельгія", "Бразилія", "Чехословаччина", "Англія", "Франція", "Угорщина", "Італія", "Південна Корея", "Мексика", "Шотландія", "Швейцарія", "Туреччина", "Уругвай", "ФРН", "Югославія"}, "Чемпіонат світу з футболу 1954 року — п'ятий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 16 червня по 4 липня 1954 року на полях Швейцарії. Увійшов в історію як найрезультативніша світова футбольна першість (у середньому забивалося по 5,38 голів за матч)."),
                new WorldCup("1958", "Швеція", "Швеція", "Бразилія", new string[] { "Швеція", "ФРН", "Австрія", "Франція", "Чехословаччина", "Угорщина", "СРСР", "Югославія", "Англія", "Північна Ірландія", "Шотландія", "Уельс", "Аргентина", "Бразилія", "Мексика", "Парагвай"}, "Чемпіонат світу з футболу 1958 року — шостий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 8 по 29 червня 1958 року на полях Швеції."),
                new WorldCup("1962", "Чилі", "Чехословаччина", "Бразилія", new string[] { "Чилі", "Бразилія", "Аргентина", "Уругвай", "Чехословаччина", "Англія", "СРСР", "ФРН", "Італія", "Угорщина", "Іспанія", "Югославія", "Болгарія", "Колумбія", "Мексика", "Швейцарія"}, "Чемпіонат світу з футболу 1962 року — сьомий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 30 травня по 17 червня 1962 року на полях Чилі. Чемпіонат запам'ятався напруженою атмосферою навколо турніру та численними проявами неспортивної поведінки на футбольному полі, найяскравішим проявом якої стала гра групового етапу між господарями турніру і Італії, що стала відомою як Битва в Сантьяго, по ходу якої поліція була змушена чотири рази виходити на поле для вгамування пристрастей."),
                new WorldCup("1966", "Англія", "ФРН", "Англія", new string[] { "Бразилія", "Аргентина", "Чилі", "Уругвай", "Англія", "Угорщина", "СРСР", "ФРН", "Франція", "Португалія", "Іспанія", "Італія", "Болгарія", "Північна Корея", "Мексика", "Швейцарія"}, "Чемпіонат світу з футболу 1966 року — восьмий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 11 по 30 липня 1966 року в Англії. Турнір став першим чемпіонатом світу, окремі матчі якого за допомогою супутникового зв'язку транслювалися до країн на інших континентах."),
                new WorldCup("1970", "Мексика", "Італія", "Бразилія", new string[] { "Англія", "Італія", "СРСР", "ФРН", "Бразилія", "Мексика", "Перу", "Уругвай", "Бельгія", "Болгарія", "Чехословаччина", "Швеція", "Сальвадор", "Ізраїль", "Марокко", "Румунія"}, "Чемпіонат світу з футболу 1970 року — дев'ятий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 31 травня по 21 червня 1970 року в Мексиці, ставши таким чином першою світовою футбольною першістю, фінальна частина якої проводилався поза межами Європи та Південної Америки."),
                new WorldCup("1974", "ФРН", "Нідерланди", "ФРН", new string[] { "ФРН", "Італія", "Нідерланди", "Шотландія", "Болгарія", "НДР", "Польща", "Югославія", "Бразилія", "Аргентина", "Чилі", "Уругвай", "Австралія", "Гаїті", "Швеція", "Заїр"}, "Чемпіонат світу з футболу 1974 року — десятий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 13 червня по 7 липня 1974 року у Федеративній Республіці Німеччина (включаючи Західний Берлін). Перший турнір, переможець якого отримував новий чемпіонський кубок, розроблений італійським скульптором Сільвіо Гоццанігою, оскільки трофей, що розігрувався на дев'яти попередніх світових першостях навіки залишився у збірної Бразилії після перемоги на чемпіонаті світу 1970, що стала для неї третьою в історії. Уперше формат світового чемпіонату передбачав проведення двох групових етапів, за результатами другого з яких відразу визначалися фіналісти та учасники гри за третє місце."),
                new WorldCup("1978", "Аргентина", "Нідерланди", "Аргентина", new string[] { "Австрія", "Франція", "Угорщина", "Італія", "Нідерланди", "Польща", "Шотландія", "Іспанія", "Швеція", "ФРН", "Мексика", "Аргентина", "Бразилія", "Перу", "Іран", "Туніс"}, "Чемпіонат світу з футболу 1978 року — одинадцятий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 1 по 25 червня 1978 року в Аргентині. Востаннє участь у фінальному турнірі мундіалю брали 16 команд, оскільки з наступного розіграшу їх кількість збільшили до 24."),
                new WorldCup("1982", "Іспанія", "ФРН", "Італія", new string[] { "Австрія", "Англія", "Бельгія", "Іспанія", "Італія", "Угорщина", "Північна Ірландія", "Польща", "СРСР", "Франція", "ФРН", "Чехословаччина", "Шотландія", "Югославія", "Гондурас", "Сальвадор", "Аргентина", "Бразилія", "Перу", "Чилі", "Кувейт", "Алжир", "Камерун", "Нова Зеландія"}, "Чемпіонат світу з футболу 1982 року — дванадцятий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 13 червня по 11 липня 1982 року в Іспанії. Перший чемпіонат світу, кількість учасників фінальної частини якого було збільшено до 24. На стадії півфіналів турніру уперше в історії світових першостей відбулися післяматчеві пенальті."),
                new WorldCup("1986", "Мексика", "ФРН", "Аргентина", new string[] { "Бельгія", "Болгарія", "Данія", "Англія", "Франція", "Угорщина", "Італія", "Північна Ірландія", "Польща", "Португалія", "Шотландія", "СРСР", "Іспанія", "ФРН", "Канада", "Мексика", "Аргентина", "Бразилія", "Парагвай", "Уругвай", "Ірак", "Південна Корея", "Алжир", "Марокко"}, "Чемпіонат світу з футболу 1986 року — тринадцятий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 31 травня до 29 червня 1986 року в Мексиці, яка стала першою країною, що удруге прийняла світову футбольну першість. Чемпіонат став зоряним часом для 25-річного на той час капітана аргентинців Дієго Марадони, який по його ходу відзначився п'ятьма голами, включаючи два свої найвідоміші голи, забиті у чвертьфіналі у ворота англійців, — «руку Бога» та «гол століття». Згодом аргентинець був визнаний гравцем чемпіонату."),
                new WorldCup("1990", "Італія", "Аргентина", "ФРН", new string[] { "Австрія", "Бельгія", "Чехословаччина", "Англія", "Італія", "Нідерланди", "Ірландія", "Румунія", "Шотландія", "СРСР", "Іспанія", "Швеція", "ФРН", "Югославія", "Коста-Рика", "США", "Аргентина", "Бразилія", "Колумбія", "Уругвай", "Південна Корея", "ОАЕ", "Єгипет", "Камерун"}, "Чемпіонат світу з футболу 1990 року — чотирнадцятий чемпіонат світу серед чоловічих збірних команд з футболу, що проходив з 8 червня до 8 липня 1990 року в Італії, яка стала другою країною, що удруге прийняла світову футбольну першість, після Мексики, господаря попереднього мундіалю. Вважається, що турнір 1990 року був найменш видовищним за всю історію чемпіонатів світу. Середня результативність матчів змагання склала рекордно низькі 2,2 голи за гру, крім того на турнірі було показано рекордні на той час 16 червоних карток, включаючи перше в історії вилучення у фіналі змагання."),
                new WorldCup("1994", "США", "Італія", "Бразилія", new string[] { "Румунія", "Швейцарія", "США", "Колумбія", "Бразилія", "Швеція", "росія", "Камерун", "Німеччина", "Іспанія", "Південна Корея", "Болівія", "Нігерія", "Болгарія", "Аргентина", "Греція", "Мексика", "Ірландія", "Італія", "Норвегія", "Нідерланди", "Саудівська Аравія", "Бельгія", "Марокко"}, "Чемпіонат світу з футболу 1994 року — 15-ий чемпіонат світу з футболу, що проводився ФІФА. Турнір проходив в США з 17 червня по 17 липня 1994 року. На чемпіонаті було зіграно 52 матчі, і було забито 141 м'яч (у середньому 2.71 м'ячі за матч). Чемпіонат світу з футболу 1994 є рекордним за кількістю глядачів — матчі в США відвідали 3 587 538 вболівальників (в середньому 68 991 за матч). Цей турнір став найбільш відвідуваною спортивною подією з одного виду спорту в історії США."),
                new WorldCup("1998", "Франція", "Бразилія", "Франція", new string[] { "Бразилія", "Норвегія", "Марокко", "Шотландія", "Італія", "Чилі", "Австрія", "Камерун", "Франція", "Данія", "ПАР", "Саудівська Аравія", "Нігерія", "Парагвай", "Іспанія", "Болгарія", "Нідерланди", "Мексика", "Бельгія", "Південна Корея", "Німеччина", "Югославія", "Іран", "США", "Румунія", "Англія", "Колумбія", "Туніс", "Аргентина", "Хорватія", "Ямайка", "Японія"}, "Чемпіонат світу з футболу 1998 - 16-й чемпіонат світу з футболу ФІФА, фінальний турнір якого пройшов у Франції з 10 червня по 12 липня. Франція приймала турнір вдруге у своїй історії (вперше був у 1938 році), перемігши у боротьбі за проведення Марокко, а турнір став дев'ятим чемпіонатом світу, що пройшов у Європі. Число учасників розширилося з 24 до 32 команд, а кількість груп розширилася до восьми."),
                new WorldCup("2002", "Корея та Японія", "Німеччина", "Бразилія", new string[] { "Данія", "Сенегал", "Уругвай", "Франція", "Іспанія", "Парагвай", "ПАР", "Словенія", "Бразилія", "Туреччина", "Коста-Рика", "Китай", "Південна Корея", "США", "Португалія", "Польща", "Німеччина", "Ірландія", "Камерун", "Саудівська Аравія", "Швеція", "Англія", "Аргентина", "Нігерія", "Мексика", "Італія", "Хорватія", "Еквадор", "Японія", "Бельгія", "росія", "Туніс"}, "Чемпіонат світу з футболу 2002 — 17-й чемпіонат світу. Проводився з 31 травня по 30 червня 2002 року на стадіонах Японії та Південної Кореї. Вперше чемпіонат світу проводився на теренах Азії та вперше — одночасно у двох країнах. Рішення про вибір місця чемпіонату світу ухвалено ФІФА в Цюриху в травні 1996. Від початку на проведення турніру претендували лише 2 країни — Японія та Південна Корея. Але 31 травня 1996, щоб не погіршувати й без того напружені відносини між двома країнами, конгрес ФІФА вирішив об'єднати дві заявки. Попри якісну організацію чемпіонату світу 2002 року, ФІФА заявило, що більше не буде практикувати проведення чемпіонатів світу в кількох країнах. Всього в турнірі брали участь 32 футбольні збірні, які кваліфікувалися із 198 країн."),
                new WorldCup("2006", "Німеччина", "Франція", "Італія", new string[] { "Німеччина", "Україна", "Нідерланди", "Польща", "Англія", "Хорватія", "Італія", "Португалія", "Швеція", "Сербія та Чорногорія", "Франція", "Швейцарія", "Іспанія", "Чехія", "Ангола", "Кот-д'Івуар", "Того", "Гана", "Туніс", "Японія", "Іран", "Південна Корея", "Саудівська Аравія", "США", "Мексика", "Коста-Рика", "Тринідад і Тобаго", "Австралія", "Аргентина", "Бразилія", "Еквадор", "Парагвай"}, "Чемпіонат світу з футболу 2006 — 18-й чемпіонат світу з футболу серед чоловічих національних збірних відбувся з 9 червня по 9 липня 2006 року в Німеччині. Німеччина виграла право на проведення фінального турніру чемпіонату світу 6 липня 2000 року, випередивши Бразилію, Марокко, Англію та, нарешті, у фіналі, 12 голосами проти 11 - Південної Африки. Виступали 32 національні збірні, усього відбулося 64 гри."),
                new WorldCup("2010", "ПАР", "Нідерланди", "Іспанія", new string[] { "Англія", "Греція", "Данія", "Іспанія", "Італія", "Нідерланди", "Німеччина", "Португалія", "Сербія", "Словаччина", "Словенія", "Франція", "Швейцарія", "ПАР", "Гана", "Кот-д'Івуар", "Нігерія", "Камерун", "Алжир", "Аргентина", "Бразилія", "Парагвай", "Чилі", "Уругвай", "Австралія", "Південна Корея", "Північна Корея", "Японія", "Гондурас", "Мексика", "США", "Нова Зеландія"}, "Чемпіонат світу з футболу 2010 — 19-й чемпіонат світу з футболу ФІФА, фінальний етап якого пройшов з 11 червня по 11 липня 2010 року в Південно-Африканській Республіці. Уперше чемпіонат світу з футболу проведено на Африканському континенті."),
                new WorldCup("2014", "Бразилія", "Аргентина", "Німеччина", new string[] { "Бразилія", "Японія", "Австралія", "Іран", "Південна Корея", "Нідерланди", "Італія", "Аргентина", "США", "Коста-Рика", "Бельгія", "Швейцарія", "Німеччина", "Колумбія", "росія", "Боснія і Герцеговина", "Англія", "Іспанія", "Чилі", "Еквадор", "Гондурас", "Нігерія", "Кот-д'Івуар", "Камерун", "Гана", "Алжир", "Португалія", "Франція", "Греція", "Хорватія", "Мексика", "Уругвай"}, "Чемпіонат світу з футболу 2014 — 20-й чемпіонат світу з футболу ФІФА, фінальний етап якого відбувся з 12 червня по 13 липня 2014 року в Бразилії. Бразилія вже вдруге прийняла мундіаль. Уперше країна приймала чемпіонат у 1950 році. Уперше на чемпіонаті світу використовувалися технології визначення голу та зникний спрей."),
                new WorldCup("2018", "росія", "Хорватія", "Франція", new string[] { "Уругвай", "росія", "Саудівська Аравія", "Єгипет", "Іспанія", "Португалія", "Іран", "Марокко", "Франція", "Данія", "Перу", "Австралія", "Хорватія", "Аргентина", "Нігерія", "Ісландія", "Бразилія", "Швейцарія", "Сербія", "Коста-Рика", "Швеція", "Мексика", "Південна Корея", "Німеччина", "Бельгія", "Англія", "Туніс", "Панама", "Колумбія", "Японія", "Сенегал", "Польща"}, "Чемпіонат світу з футболу 2018 — 21-й чемпіонат світу з футболу ФІФА, фінальний етап якого проходив з 14 червня по 15 липня 2018 року в країні-гній. Міністерство юстиції США стверджує, що є докази підкупу гнійниками чиновників ФІФА заради проведення в них чемпіонату."),
                new WorldCup("2022", "Катар", "Франція", "Аргентина", new string[] { "Австралія", "Іран", "Катар", "Південна Корея", "Саудівська Аравія", "Японія", "Гана", "Камерун", "Марокко", "Сенегал", "Туніс", "Канада", "Коста-Рика", "Мексика", "США", "Аргентина", "Бразилія", "Еквадор", "Уругвай", "Англія", "Бельгія", "Данія", "Іспанія", "Нідерланди", "Німеччина", "Польща", "Португалія", "Сербія", "Уельс", "Хорватія", "Швейцарія", "Франція"}, "Чемпіонат світу з футболу 2022  — 22-й чемпіонат світу з футболу ФІФА, фінальний етап якого проходив з 20 листопада по 18 грудня 2022 року в Катарі. Крім того, світова першість вперше відбувалася на Близькому Сході, а також — у Північній півкулі — восени й узимку. Це обумовлено погодними умовами в країні-господарці, де в червні-липні спостерігається надмірно висока температура повітря, понад 40 °C."),
            };
        }

        static void ShowYearAndLocationWorldCups(WorldCup[] worldCups)
        {
            Console.WriteLine("\nРік - місце проведення:");
            foreach (WorldCup worldCup in worldCups)
            {
                Console.WriteLine($"{worldCup.Year} - {worldCup.Location};");
            }
        }

        static int FindWorldCupIndexByYear(WorldCup[] worldCups, string year)
        {
            int index = -1;
            for (int i = 0; i < worldCups.Length; i += 1)
            {
                if (year == worldCups[i].Year)
                {
                    index = i;
                    break;
                }
            }
            return index;
        }

        static void ShowDetailInfoByIndex(WorldCup[] worldCups, int index)
        {
            Console.Write($"\n{worldCups[index].Info}\n");
            Console.Write($"Участь у чемпіонаті приймали такі збірні: ");
            for (int i = 0; i < worldCups[index].Participants.Length; i++)
            {
                if (i == worldCups[index].Participants.Length - 1)
                {
                    Console.Write($"{worldCups[index].Participants[i]}.\n");
                }
                else
                {
                    Console.Write($"{worldCups[index].Participants[i]}, ");
                }
            }
            Console.WriteLine($"Чемпіон: {worldCups[index].Winner}.");
            Console.WriteLine($"Срібний призер: {worldCups[index].Finalist}.");
        }

        static void HandleInvalidYear(string year)
        {
            if (year == "1942" || year == "1946")
            {
                WriteError("\nУ 1942 та 1946 роках турнір не розігрували через Другу світову війну!");
            }
            else
            {
                WriteError($"\nУ {year} році чемпіонат світу не проводився!");
            }
        }

        static WorldCup[] FindWorldCupsByCountry(WorldCup[] worldCups, string country)
        {
            WorldCup[] newArray = new WorldCup[0];

            for (int i = 0; i < worldCups.Length; i += 1)
            {
                foreach (string participant in worldCups[i].Participants)
                {
                    if (participant.ToLower() == country.ToLower())
                    {
                        WorldCup[] temp = new WorldCup[newArray.Length + 1];
                        for (int j = 0; j < newArray.Length; j += 1)
                        {
                            temp[j] = newArray[j];
                        }
                        temp[temp.Length - 1] = worldCups[i];
                        newArray = temp;
                    }
                }
            }
            return newArray;
        }

        static void ShowFavoriteTeamInfo(WorldCup[] worldCups, string country)
        {
            if (worldCups.Length == 1)
            {
                Console.WriteLine($"\nЗбірна {country} брала участь у Чемпіонаті Світу: ");
            }
            else
            {
                Console.WriteLine($"\nЗбірна {country} брала участь у Чемпіонатах Світу: ");
            }
            ShowYearAndLocationWorldCups(worldCups);
        }

        static bool CheckCountryValidity(string country)
        {
            string[] allCountries = { "Афганістан", "Албанія", "Алжир", "Андорра", "Ангола", "Англія", "Антигуа і Барбуда", "Аргентина", "Вірменія", "Австралія", "Австрія", "Азербайджан", "Багамські Острови", "Бахрейн", "Бангладеш", "Барбадос", "Білорусь", "Бельгія", "Беліз", "Бенін", "Бутан", "Болівія", "Боснія і Герцеговина", "Ботсвана", "Бразилія", "Бруней", "Болгарія", "Буркіна-Фасо", "Бурунді", "Кабо-Верде", "Камбоджа", "Камерун", "Канада", "Центральноафриканська Республіка", "Чад", "Чилі", "Китай", "Колумбія", "Коморські Острови", "Конго", "Коста-Рика", "Хорватія", "Куба", "Кіпр", "Чеська Республіка", "Данія", "Джибуті", "Домініка", "Домініканська Республіка", "Східний Тимор", "Еквадор", "Єгипет", "Сальвадор", "Екваторіальна Гвінея", "Еритрея", "Естонія", "Ефіопія", "Фіджі", "Фінляндія", "Франція", "Габон", "Гамбія", "Грузія", "Німеччина", "Гана", "Греція", "Гренландія", "Гренада", "Гваделупа", "Гватемала", "Гвінея", "Гвінея-Бісау", "Гаяна", "Гаїті", "Гондурас", "Угорщина", "Ісландія", "Індія", "Індонезія", "Іран", "Ірак", "Ірландія", "Ізраїль", "Італія", "Ямайка", "Японія", "Йорданія", "Казахстан", "Кенія", "Кірибаті", "Кувейт", "Киргизстан", "Лаос", "Латвія", "Ліван", "Лесото", "Ліберія", "Лівія", "Ліхтенштейн", "Литва", "Люксембург", "Македонія", "Мадагаскар", "Малаві", "Малайзія", "Мальдіви", "Малі", "Мальта", "Мартиніка", "Мавританія", "Маврикій", "Мексика", "Молдова", "Монако", "Монголія", "Чорногорія", "Марокко", "Мозамбік", "М'янма", "Намібія", "Науру", "Непал", "Нідерланди", "Нова Зеландія", "Нікарагуа", "Нігер", "Нігерія", "Північна Корея", "Північна Македонія", "Норвегія", "Оман", "Пакистан", "Палестинські Території", "Панама", "Папуа-Нова Гвінея", "Парагвай", "Перу", "Філіппіни", "Польща", "Португалія", "Пуерто-Ріко", "Катар", "Румунія", "Руанда", "Сент-Кіттс і Невіс", "Сент-Люсія", "Сент-Вінсент і Гренадини", "Самоа", "Сан-Марино", "Сан-Томе і Принсіпі", "Саудівська Аравія", "Сенегал", "Сербія", "Сейшельські Острови", "Сьєрра-Леоне", "Сінгапур", "Словаччина", "Словенія", "Соломонові Острови", "Сомалі", "Південна Африка", "Південна Корея", "Південний Судан", "Іспанія", "Шрі-Ланка", "Судан", "Суринам", "Свазіленд", "Швеція", "Швейцарія", "Сирія", "Таджикистан", "Танзанія", "Таїланд", "Того", "Тонга", "Тринідад і Тобаго", "Туніс", "Туреччина", "Туркменістан", "Тувалу", "Уганда", "Україна", "Об'єднані Арабські Емірати", "США", "Уругвай", "Узбекистан", "Вануату", "Ватикан", "Венесуела", "В'єтнам", "Ємен", "Замбія", "Зімбабве", "росія" };

            for (int i = 0; i < allCountries.Length; i++)
            {
                if (allCountries[i].ToLower() == country.ToLower())
                {
                    return true;
                }
            }
            return false;
        }

        static void HandleInvalidCountry(string country)
        {
            bool countryIsValid = CheckCountryValidity(country);

            if (countryIsValid)
            {
                WriteError($"\n{country} не приймала участь у фінальних частинах чемпіонатів світу!");
            }
            else
            {
                WriteError($"\nТакої країни як {country} не існує!"); ;
            }
        }

        static bool CheckWonOtherWorldCups(WorldCup[] worldCups, string finalist)
        {
            bool hasWonWorldCup = false;

            for (int i = 0; i < worldCups.Length; i += 1)
            {
                if (worldCups[i].Winner == finalist)
                {
                    hasWonWorldCup = true;
                    break;
                }
            }
            return hasWonWorldCup;
        }

        static string[,] GetWorldCupsWinnersWithCounts(WorldCup[] worldCups)
        {
            string[,] winners = new string[0, 2];
            for (int i = 0; i < worldCups.Length; i += 1)
            {
                winners = UpdateCountriesMatrixWithCounts(worldCups[i].Winner, winners);
            }
            return winners;
        }

        static string[,] GetWorldCupsLosersWithCounts(WorldCup[] worldCups)
        {
            string[,] losers = new string[0, 2];
            for (int i = 0; i < worldCups.Length; i += 1)
            {
                bool hasWonWorldCup = CheckWonOtherWorldCups(worldCups, worldCups[i].Finalist);

                if (!hasWonWorldCup)
                {
                    losers = UpdateCountriesMatrixWithCounts(worldCups[i].Finalist, losers);
                }
            }
            return losers;
        }

        static string[,] UpdateCountriesMatrixWithCounts(string country, string[,] countries)
        {
            int countryIndex = FindIndex(country, countries);

            if (countryIndex < 0)
            {
                string[,] temp = new string[countries.GetLength(0) + 1, countries.GetLength(1)];
                for (int j = 0; j < countries.GetLength(0); j += 1)
                {
                    temp[j, 0] = countries[j, 0];
                    temp[j, 1] = countries[j, 1];
                }
                temp[temp.GetLength(0) - 1, 0] = country;
                temp[temp.GetLength(0) - 1, 1] = "1";
                countries = temp;
            }
            else
            {
                int tempValue = Convert.ToInt32(countries[countryIndex, 1]);
                tempValue += 1;
                countries[countryIndex, 1] = tempValue.ToString();
            }
            return countries;
        }

        static int FindIndex(string country, string[,] countries)
        {
            int index = -1;
            for (int i = 0; i < countries.GetLength(0); i += 1)
            {
                if (countries[i, 0] == country)
                {
                    index = i;
                    break;
                }
            }
            return index;
        }

        static void ShowWinnersWorldCups(string[,] winners)
        {
            Console.WriteLine("\nСписок преможців чемпіонатів світу: ");
            for (int i = 0; i < winners.GetLength(0); i++)
            {
                string country = winners[i, 0];
                string counts = winners[i, 1];

                if (counts == "1")
                {
                    Console.WriteLine($"Збірна {country} перемагала {counts} раз.");
                }
                else
                {
                    Console.WriteLine($"Збірна {country} перемагала {counts} разів.");
                }
            }
        }

        static string[,] SortByCountWins(string[,] winners)
        {
            for (int i = 0; i < winners.GetLength(0) - 1; i += 1)
            {
                for (int j = 0; j < winners.GetLength(0) - i - 1; j += 1)
                {
                    int currentQuantity = Convert.ToInt32(winners[j, 1]);
                    int nextQuantity = Convert.ToInt32(winners[j + 1, 1]);

                    if (currentQuantity < nextQuantity)
                    {
                        string tempWinner = winners[j, 0];
                        string tempQuantity = winners[j, 1];
                        winners[j, 0] = winners[j + 1, 0];
                        winners[j, 1] = winners[j + 1, 1];
                        winners[j + 1, 0] = tempWinner;
                        winners[j + 1, 1] = tempQuantity;
                    }
                }
            }
            return winners;
        }

        static string[] FindMainLoserWorldCups(string[,] losers)
        {
            string mainLoser = losers[0, 0];
            int maxFailures = Convert.ToInt32(losers[0, 1]);
            for (int i = 1; i < losers.GetLength(0); i++)
            {
                int failures = Convert.ToInt32(losers[i, 1]);
                if (maxFailures < failures)
                {
                    maxFailures = failures;
                    mainLoser = losers[i, 0];
                }
            }
            return new string[] { mainLoser, maxFailures.ToString() };
        }

        static void ShowMainLoserWorldCups(string[] mainLoser)
        {
            Console.WriteLine($"\nЗбірна {mainLoser[0]} стала командою, яка найбільше разів({mainLoser[1]}) програвала у фіналах Чемпіонату світу з футболу, але ніколи не здобула цього престижного кубка.");
        }
    }

    class WorldCup
    {
        public string Year;
        public string Location;
        public string Finalist;
        public string Winner;
        public string[] Participants;
        public string Info;
        public WorldCup(string year, string location, string finalist, string winner, string[] participants, string info)
        {
            Year = year;
            Location = location;
            Finalist = finalist;
            Winner = winner;
            Info = info;

            Array.Sort(participants);

            Participants = participants;
        }
    }
}
